In [1]:
import pandas as ps

In [3]:
df=pd.read_csv('salaries.csv')
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [4]:
X=df.drop('salary_more_then_100k',axis=1)

In [6]:
X.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [7]:
Y=df.salary_more_then_100k

In [8]:
Y.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

In [9]:
from sklearn.preprocessing import LabelEncoder

In [10]:
le=LabelEncoder()

In [17]:
X['company_new']=le.fit_transform(X['company'])
X['job_new']=le.fit_transform(X['job'])
X['degree_new']=le.fit_transform(X['degree'])

In [18]:
X.head()

  company                  job     degree  company_new  job_new  degree_new
0  google      sales executive  bachelors            2        2           0
1  google      sales executive    masters            2        2           1
2  google     business manager  bachelors            2        0           0
3  google     business manager    masters            2        0           1
4  google  computer programmer  bachelors            2        1           0

In [23]:
X.drop(X.iloc[:,0:3],inplace=True,axis=1)

In [24]:
X.head()

   company_new  job_new  degree_new
0            2        2           0
1            2        2           1
2            2        0           0
3            2        0           1
4            2        1           0

In [25]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [26]:
from sklearn.model_selection import train_test_split

In [36]:
X_train,X_test,Y_train,Y_test=train_test_split(X,Y,test_size=0.3)

In [37]:
model.fit(X_train,Y_train)

DecisionTreeClassifier()

In [38]:
model.score(X_test,Y_test)

0.8

In [44]:
model.predict([[1,1,0]])

array([1], dtype=int64)